<details><summary>Digger run report at 2024-08-05 07:33:40 (UTC)</summary>
        <details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_cluster has been locked by PR #9
</details>

→ No changes in terraform output for anzeha/floorball-fantasy-infra#staging_cluster


<details><summary>Plan for <b>anzeha/floorball-fantasy-infra#staging_kubernetes-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # kubernetes_namespace.example will be created
  + resource "kubernetes_namespace" "example" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "example-annotation"
            }
          + generation       = (known after apply)
          + labels           = {
              + "mylabel" = "label-value"
            }
          + name             = "terraform-example-namespace"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on kubernetes-provider.tf line 2, in provider "kubernetes":
   2: provider "kubernetes" {

'cluster_ca_certificate' is not a valid PEM encoded certificate

  ```
</details>


<details><summary>Terraform plan validation check (staging_kubernetes-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>